export interface Choice {
  text: string;
  nextId: number | null;
  selected?: boolean;
}

export interface Node {
  id: number;
  text: string;
  choices: Choice[];
  image?: string;
}

export const initialStoryData: Node[] = [
  {
    "id": 1,
    "text": "你是某国男性,简称国男，20岁,是学生，就读于某高校。今天你没有课， 你决定:",
    "choices": [
      { "text": "待在宿舍", "nextId": 2 },
      { "text": "出去逛逛", "nextId": 3 }
    ]
  },
  {
    "id": 2,
    "text": "你打算在宿舍享受一下颓废的生活，于是叫了一份外卖开始打游戏。几轮厮杀过后，看到你舍友问你为什么在食堂对着女生DIY，你感觉莫名其妙，一番网上冲浪后才知道，社交网络上到处都是你的负面消息，而你今天并没有出过宿舍。事后事件源头的女生表示事件纯属虚构，而你已经社会性死亡。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 3,
    "text": "出门应该带上哪些东西好呢，你看看手机、平板、kindle、switch...决定：",
    "choices": [
      { "text": "全都带上", "nextId": 4 },
      { "text": "只带必要的", "nextId": 5 }
    ]
  },
  {
    "id": 4,
    "text": "由于你的包太大，不小心碰到了一位学姐的屁股，她在社交网络上称你是色狼，你社会性死亡。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 5,
    "text": "你只带了手机和蓝牙耳机。你在学校逛了一圈， 看了看时间该吃午饭了，于是你来到食堂，发现这里已经人满患，你选了一个看起来不太长的队伍走了过去：",
    "choices": [
      { "text": "为了防止有人插队，你紧紧跟着前一个人", "nextId": 6 },
      { "text": "和前一个人保持距离", "nextId": 7 }
    ]
  },
  {
    "id": 6,
    "text": "你距离前面的女生太近，被她拍了下来，并且在社交网络上称你对她图谋不轨，你社会性死亡。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 7,
    "text": "你和前一个人保持距离",
    "choices": [
      { "text": "玩手机打发时间", "nextId": 8 },
      { "text": "听歌就好", "nextId": 9 }
    ]
  },
  {
    "id": 8,
    "text": "你和前一个人保持着距离，但是队伍移动得很慢，你打算：",
    "choices": [
      { "text": "玩手机打发时间", "nextId": 10 },
      { "text": "听歌就好", "nextId": 11 }
    ]
  },
  {
    "id": 9,
    "text": "你继续吃饭，吃完饭回宿舍，刚吃饱的你不太想运动，但是电梯里已经站了几个女生,你决定：",
    "choices": [
      { "text": "坐电梯", "nextId": 12 },
      { "text": "走楼梯", "nextId": 13 }
    ]
  },
  {
    "id": 10,
    "text": "你跟着队伍打到了饭, 吃饭时耳机没电了，你草草收了起来，便一边吃饭一边玩手机。这时你注意到一个女生在偷你耳机，你：",
    "choices": [
      { "text": "制止她", "nextId": 14 },
      { "text": "假装没看到", "nextId": 15 }
    ]
  },
  {
    "id": 11,
    "text": "你将小偷捉了现行，对方却表示“抛开事实不谈，你坐了我常坐的位子难道就没错吗”，然后砸了你的耳机扬长而去。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 12,
    "text": "电梯作为公共资源，当然可以用，你抱着这个想法走进电梯，却被电梯里的女生认为是抢占她们的资源，并对你网曝，后来学校禁止低楼层的男生使用电梯。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 13,
    "text": "你爬楼梯回到宿舍,之后无惊无险的毕业，找了一家公司996,贷款买了车房，通过相亲结了婚，婚后一年有了个儿子，转眼儿子便到了上小学的年纪，你肩上的担子更重了。这天你破天荒的准时下班，你看时间还早，决定：",
    "choices": [
      { "text": "回家休息", "nextId": 16 },
      { "text": "赚点外快", "nextId": 17 }
    ]
  },
  {
    "id": 14,
    "text": "你看了看时间，儿子差不多放学了，于是你将放学的儿子接回家。之后你和老婆响应国家号召生了二胎，并开始准备三胎。可是随着二儿子长大，他和大儿子之间的容貌差异越来越大，你看在眼里，决定：",
    "choices": [
      { "text": "装不知道", "nextId": 18 },
      { "text": "做亲子鉴定", "nextId": 19 }
    ]
  },
  {
    "id": 15,
    "text": "你难得有时间休息 ,迷迷糊糊地拒绝了，平时儿子不用接能回来，今天应该也可以。但是今天你儿子很晚都没回来，后来得知，你儿子被一名女子抱到楼上摔死。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 16,
    "text": "难得有这空闲时间，你打算回家休息。停车时发现你的停车位被一陌生车辆占用，你决定：",
    "choices": [
      { "text": "想办法联系车主", "nextId": 20 },
      { "text": "换个车位", "nextId": 21 }
    ]
  },
  {
    "id": 17,
    "text": "你在网约车平台注册了账户，平台推来两份可接单，你选择：",
    "choices": [
      { "text": "第一份", "nextId": 22 },
      { "text": "第二份", "nextId": 23 },
      { "text": "都不接", "nextId": 2 }
    ]
  },
  {
    "id": 18,
    "text": "你对两个儿子的容貌差异视若无睹，视如己出，老婆对你很满意，不久，你们又生了第三胎。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 19,
    "text": "心中的疑问越来越大，你悄悄带着两个孩子做了亲子鉴定，发现两个孩子都不是自己的。你和妻子为此吵了一架， 你决定离婚，同时为了眼不见心不烦，搬去和父母一起住。这天岳父敲门，说是为他女儿的事来赔礼，你决定：",
    "choices": [
      { "text": "见面聊聊", "nextId": 24 },
      { "text": "不见", "nextId": 26 }
    ]
  },
  {
    "id": 20,
    "text": "车主在雨刮器上留了联系方式，电话打通后，车主下来开车离开了。回到家，老婆在洗澡，你躺在沙发小憩。迷迷糊糊中老婆叫你去接儿子，你：",
    "choices": [
      { "text": "去接", "nextId": 27 },
      { "text": "不去", "nextId": 25 }
    ]
  },
  {
    "id": 21,
    "text": "你换了个没人用的车位. 回到家，发现门前有一双不认识的男鞋，开门看到老婆正在和一名陌生男子一起为爱鼓掌。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 22,
    "text": "你选了第一份单，叫车的是一位女性，目的地不算远，你凭着记忆中的路线开了过去，没想到在快到目的地时，乘客突然跳车，随后身亡，你被拘留二百天。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 23,
    "text": "叫车的是一位丰满的女性，手一直插在裤兜里，目的地有点远，中间要走一段高速公路。上了高速以后，乘客从裤兜里掏出一把刀，对你连捅数刀，你重伤住院。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 24,
    "text": "你打开门，没想到岳父带着刀，他趁你不防砍倒了你，又砍倒了你的父母，然后报警自首，之后你老婆出具谅解书，减轻了岳父的刑责，并带着你的家产改嫁了。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 25,
    "text": "你难得有时间休息 ,迷迷糊糊地拒绝了，平时儿子不用接能回来，今天应该也可以。但是今天你儿子很晚都没回来，后来得知，你儿子被一名女子抱到楼上摔死。",
    "choices": [
      { "text": "如果能重来...", "nextId": 1 }
    ]
  },
  {
    "id": 26,
    "text": "你避免了所有的不幸",
    "choices": [
      { "text": "恭喜你已通关当前版本，本游戏中所有结局，除“同道中人”不确定是否有真实案例外，均根据真实事件改编，如有雷同，刻意为之。", "nextId": 1 }
    ]
  },
  {
    "id": 27,
    "text": "你避免了所有的不幸",
    "choices": [
      { "text": "恭喜你已通关当前版本，本游戏中所有结局，除“同道中人”不确定是否有真实案例外，均根据真实事件改编，如有雷同，刻意为之。", "nextId": 1 }
    ]
  }
];

